1c/src/Documents/ОформлениеАбонемента.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>ОформлениеАбонемента</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ОстаткиАбонементов</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Клиенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидАбонемента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыАбонементов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АбонементКлиента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АбонементыКлиентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоПосещений</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

1c/src/Documents/ОформлениеАбонемента/Forms/ФормаДокумента/Ext/Form.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Объект.Ссылка.Пустая() Тогда
		Объект.Дата      = ТекущаяДата();
		Объект.ДатаНачала = НачалоДня(ТекущаяДата());
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
КонецПроцедуры

&НаКлиенте
Процедура ВидАбонементаПриИзменении(Элемент)
	ЗаполнитьПоВидуАбонементаНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ДатаНачалаПриИзменении(Элемент)
	ПересчитатьДатуОкончанияНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПоВидуАбонементаНаСервере()
	Если Объект.ВидАбонемента.Пустая() Тогда
		Возврат;
	КонецЕсли;
	ВидАб = Объект.ВидАбонемента.ПолучитьОбъект();
	Объект.КоличествоПосещений = ВидАб.КоличествоПосещений;
	Объект.Сумма               = ВидАб.Цена;
	ДнейДействия               = ВидАб.СрокДействияВДнях - 1;
	Объект.ДатаОкончания       = КонецДня(Объект.ДатаНачала + ДнейДействия * 86400);
КонецПроцедуры

&НаСервере
Процедура ПересчитатьДатуОкончанияНаСервере()
	Если Объект.ВидАбонемента.Пустая() Тогда
		Возврат;
	КонецЕсли;
	ВидАб          = Объект.ВидАбонемента.ПолучитьОбъект();
	ДнейДействия   = ВидАб.СрокДействияВДнях - 1;
	Объект.ДатаОкончания = КонецДня(Объект.ДатаНачала + ДнейДействия * 86400);
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	// Проверка обязательных полей
	Если Объект.Клиент.Пустая() Тогда
		Сообщить("Необходимо указать клиента!");
		Отказ = Истина;
	ИначеЕсли Объект.ВидАбонемента.Пустая() Тогда
		Сообщить("Необходимо указать вид абонемента!");
		Отказ = Истина;
	ИначеЕсли Объект.Сумма <= 0 Тогда
		Сообщить("Сумма должна быть больше нуля!");
		Отказ = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	Оповестить("ОбновлениеДокумента_ОформлениеАбонемента");
КонецПроцедуры

#КонецОбласти
